IDEA Open Model
RebarPolyLine3D Class
Compatible with IDEA StatiCa 20.1
 Represents a polyline in 3D space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Model.RebarPolyLine3D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class RebarPolyLine3D : OpenObject
Public Class RebarPolyLine3D
	Inherits OpenObject
The RebarPolyLine3D type exposes the following members.
Constructors
Name | Description
RebarPolyLine3D
 Constructor
Top
Properties
Name | Description
Segments
 Gets segments of RebarPolyLine3D.
StartPoint
 Gets or sets the point where the RebarPolyLine3D begins.
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace